<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%

String foods[][]={{"탕수육","깐풍기","칠리새우","짬뽕","중식","사천탕수육","짜장면","유린기","북경식탕수육"},
		{"초밥","돈부리","참치회","소바","일식","오코노미야끼","라멘","장어덮밥","우동"},
		{"삼겹살","갈비","갈매기살","항정살","고기","목살","가브리살","등심","안심"},
		{"신라면","짜왕","너구리","라면","불닭볶음면","삼양라면","진라면","안성탕면"},
		{"중식","일식","고기","라면","배고픔","기타","한식","치킨","분식/야식/디저트"},
		{"스테이크","파스타","훈제오리","햄버거","기타","베트남쌀국수","피자","만두","커리"},
		{"냉면","설렁탕","닭도리탕","간장게장","한식","김치찌재","낙지","불고기백반","곱창"},
		{"BBQ","BHC","호식이","굽네치킨","치킨","네네치킨","교촌치킨","KFC","파파이스"},
		{"떡볶이","순대","빙수","오뎅","분식/야식/디저트","보쌈","케이크","빵","푸딩"}};

String country[][]={{"규동","우동","미소시루","가츠동","일본","오니기리","하이라이스","라멘","오코노미야끼"},
		{"해물파전","쌈밥","된장찌개","비빕밥","한국","칼국수","불고기","떡볶이","제육볶음"},
		{"깐풍기","볶음면","동파육","짜장면","중국","짬뽕","마파두부","탕수육","고추잡채"},
		{"라자냐","그라탕","뇨끼","스파게티","이탈리아","피자","리조토","프리타타","파니니"},
		{"일본","한국","중국","이탈리아","나라별","동남아","프랑스","미국","중동"},
		{"팟타이","카오팟","나시고랭","쌀국수","동남아","연유라떼","반미","짜조","분짜"},
		{"부야베스","라타투이","프렌치토스트","마카롱","프랑스","끼슈","코코뱅","크로크무슈","뱅쇼"},
		{"햄버거","핫도그","클램차우더","바비큐","미국","치킨","맥앤치즈","미트로프","에그베네딕트"},
		{"케밥","허머스","팔라펠","샥슈카","페투쉬","필라프","무사카","피타","쿠스쿠스"}};

%>

<body>
mandalArtProc.jsp
<table border="1">
<%-- <%
	for(int i=0;i<foods.length;i++){%> --%>
<tr>
<%
	for(int j=0;j<foods.length;j++){%>

<td><%=foods[0][j] %></td>

<%}%>
	
	<tr>
<%-- <%}
%> --%>


<tr>
<td><%=foods[0][0]%></td>
<td>1_2</td>
<td>1_3</td>

</tr>

<tr>
<td>2_1</td>
<td>2_2</td>
<td>2_3</td>
</tr>

<tr>
<td>3_1</td>
<td>3_2</td>
<td>3_3</td>
</tr>
</table>


</body>
</html>