<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%

String kinds[][]={{"청국장","순두부찌개","고추장찌개","갈비찜","닭볶음탕","스테이크","연근조름","시금치무침","감자조림"},
				{"부대찌개","김치찌개","된장찌개","아귀찜","삼계탕","수육","감자채볶음","장조림","진미채볶음"},
				{"비지찌개","전찌개","동태찌개","월남쌈","불고기","찜닭","콩조림","콩나물무침","멸치볶음"},
				{"제육덮밥","비빔밥","오므라이스","찌개","특식","밑반찬","토스트","또띠아피자","떡꼬치"},
				{"카레덮밥","김치볶음밥","오징어덮밥","덮/볶음밥","종류별","간식","쿠키","떡볶이","호떡"},
				{"짜장밥","야채볶음밥","간장밥","국","야식/술안주","면","샌드위치","시리얼","팝시클"},
				{"육개장","떡국","미역국","두부김치","튀김","소시지야채볶음","라면","토마토스파게티","크림스파게티"},
				{"콩나물국","붓엇국","소고기무국","콘치즈","골뱅이무침","부침개","잔치국수","비빔국수","칼국수"},
				{"시래깃국","된장국","감잣국","어묵탕","닭똥집볶음","순대볶음","우동","볶음우동","콩국수"}};

String country[][]={{"규동","우동","미소시루","해물파전","김치","쌈밥","깐풍기","볶음면","동파육"},
				{"찜닭","가츠동","오니기리","된장찌개","비빔밥","칼국수","짜장면","짬뽕","마파두부"},
				{"하이라이스","라멘","오코노미야끼","불고기","떡볶이","제육볶음","탕수육","토마토달걀볶음","고추잡채"},
				{"라자냐","그라탕","뇨끼","일본","한국","중국","팟타이","카오팟","나시고랭"},
				{"스파게티","나폴리피자","리소토","이탈리아","나라별","동남아","볶음밥","쌀국수","연유라떼"},
				{"알프레도","프리타타","파니니","프랑스","미국","중동","반미","짜조","분짜"},
				{"부야베스","라타투이","프렌치토스트","햄버거","핫도그","클램차우더","케밥","허머스","팔라펠"},
				{"끼슈","마카롱","뵈프부르기뇽","바비큐","치킨","맥앤치즈","샥슈카","페투쉬","필라프"},
				{"코코뱅","크로크무슈","뱅쇼","잠발라야","미트로프","에그베네틱트","무사카","피타","쿠스쿠스"}};


%>
<html>
<head>
<link rel="stylesheet" href="css/mandalArt.css">

</head>
<body>
mandalArtProc.jsp margin width

<!-- <form>
<input type="button" value="종류별" onclick='kind()'>
<input type="button" value="종류별" onclick='country()'>
</form> -->

<table border="1" style="width:800px;height:800px;margin:auto;text-align:center; border-collapse:collapse;">
<colgroup>
<col span=9 width="9%"/>
</colgroup>
<%
	for(int i=0;i<country.length;i++){%>
<tr height="40px">
<%
	for(int j=0;j<country.length;j++){%>

<td style="padding-top:0px;"><button class="button"><%=kinds[i][j] %></button></td>

<%}%>
	
</tr>
<%}%> 



</table>


</body>
</html>